package ru.medwedSa.Lessen_4_OnlineChat_Start.HomeWork;

/**
 *     Домашнее задание: (продолжение работы с чат_ботом)
 * 1.: Реализовать возможность отсылать сообщение по нажатию кнопки send в чат_боте или по нажатию клавиши enter.
 * 2.: Создать файл .txt для сохранения в него всех набранных пользователем сообщений.
 * 3.: Прочитать методичку к следующему уроку.
 */
public class HomeWorkMain {

    // Решение было добавлено пул_реквестом в пакете ClassWork
    // Пул_реквест затерялся... Придется разбираться самому((((

}

